Revit 2027 API
XYZ.BasisZ Property
The basis of the Z axis.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static XYZ BasisZ { get; }
Public Shared ReadOnly Property BasisZ As XYZ
	Get
public:
static property XYZ^ BasisZ {
	XYZ^ get ();
}
static member BasisZ : XYZ with get
Property Value
XYZ
Remarks
The basis of the Z axis is the vector (0,0,1), the unit vector on the Z axis.
See Also
Reference
XYZ Class
Autodesk.Revit.DB Namespace